# Создание  списка книг со словарями
books = [
{"title": "Война и мир", "author": "Лев Толстой",  "year": 1869},
{"title": "Остров сокровищ", "author": "Роберт Льюис",  "year": 1883},
{"title": "Дом в котором", "author": "Мариам Петросян",  "year": 2009},
{"title": "Сто лет одиночества", "author": "Габриэль Гарсиа",  "year": 1967},
{"title": "Унесенные ветром", "author": "Маргарет Митчелл",  "year": 1936},
]
# Вывод информации о каждой книге
i = 1
for book in books:
    print(f"----------------------- Книга {i} -----------------------") 
    print(f"Название: {book['title']}, Aвтор: {book['author']},") 
    print(f"-------------------------{book['year']}--------------------------")
    print() #Пустая строка для разделения книг
    i +=1 #Увеличение счетчика  